; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-3-4-214)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p2-0 - location
	p2-1 - location
	p2-4 - location
	p4-0 - location
	p3-0 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s3)
	(at driver3 s4)
	(at truck1 s3)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s3)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s1)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at package1 s1)
	(at package2 s4)
	(at package3 s3)
	(at package4 s2)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 77)
	(= (time-to-walk p2-0 s2) 77)
	(= (time-to-walk s0 p2-0) 51)
	(= (time-to-walk p2-0 s0) 51)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(= (time-to-walk s2 p2-1) 42)
	(= (time-to-walk p2-1 s2) 42)
	(= (time-to-walk s1 p2-1) 25)
	(= (time-to-walk p2-1 s1) 25)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(= (time-to-walk s2 p2-4) 53)
	(= (time-to-walk p2-4 s2) 53)
	(= (time-to-walk s4 p2-4) 28)
	(= (time-to-walk p2-4 s4) 28)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(= (time-to-walk s4 p4-0) 36)
	(= (time-to-walk p4-0 s4) 36)
	(= (time-to-walk s0 p4-0) 38)
	(= (time-to-walk p4-0 s0) 38)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(= (time-to-walk s3 p3-0) 43)
	(= (time-to-walk p3-0 s3) 43)
	(= (time-to-walk s0 p3-0) 77)
	(= (time-to-walk p3-0 s0) 77)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 5)
	(= (time-to-drive s0 s2) 5)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 37)
	(= (time-to-drive s1 s2) 37)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 53)
	(= (time-to-drive s4 s2) 53)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 28)
	(= (time-to-drive s1 s0) 28)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 20)
	(= (time-to-drive s1 s3) 20)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 22)
	(= (time-to-drive s4 s3) 22)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver2 s3)
	(at driver3 s1)
	(at truck1 s4)
	(at truck2 s1)
	(at truck3 s1)
	(at package1 s0)
	(at package2 s4)
	(at package3 s0)
	(at package4 s0)
	))

(:metric minimize (+ (* 3 (total-time)) (* 2 (fuel-used))))

)

; plan
1. (board-truck driver2 truck2 s3)
   deleted: (at driver2 s3) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 2 of 9
2. (load-truck package3 truck2 s3)
   deleted: (at package3 s3)
   added: (in package3 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 2 of 9
3. (drive-truck truck2 s3 s1 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   changed: (fuel-used) from 0 to 220
   goals met: 3 of 9
4. (load-truck package1 truck2 s1)
   deleted: (at package1 s1)
   added: (in package1 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 3 of 9
5. (walk driver3 s4 p2-4)
   deleted: (at driver3 s4)
   added: (at driver3 p2-4)
   goals met: 3 of 9
6. (drive-truck truck2 s1 s3 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   changed: (fuel-used) from 220 to 480
   goals met: 2 of 9
7. (walk driver3 p2-4 s2)
   deleted: (at driver3 p2-4)
   added: (at driver3 s2)
   goals met: 2 of 9
8. (walk driver3 s2 p2-1)
   deleted: (at driver3 s2)
   added: (at driver3 p2-1)
   goals met: 2 of 9
9. (walk driver3 p2-1 s1)
   deleted: (at driver3 p2-1)
   added: (at driver3 s1)
   goals met: 3 of 9
10. (drive-truck truck2 s3 s1 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   changed: (fuel-used) from 480 to 740
   goals met: 4 of 9
11. (walk driver1 s0 p3-0)
   deleted: (at driver1 s0)
   added: (at driver1 p3-0)
   goals met: 4 of 9
12. (walk driver1 p3-0 s3)
   deleted: (at driver1 p3-0)
   added: (at driver1 s3)
   goals met: 4 of 9
13. (board-truck driver1 truck1 s3)
   deleted: (at driver1 s3) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 4 of 9
14. (drive-truck truck1 s3 s4 driver1)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   changed: (fuel-used) from 740 to 960
   goals met: 5 of 9
15. (drive-truck truck2 s1 s0 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   changed: (fuel-used) from 960 to 1324
   goals met: 4 of 9
16. (unload-truck package1 truck2 s0)
   deleted: (in package1 truck2)
   added: (at package1 s0)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 5 of 9
17. (unload-truck package3 truck2 s0)
   deleted: (in package3 truck2)
   added: (at package3 s0)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 6 of 9
18. (drive-truck truck2 s0 s1 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (fuel-used) from 1324 to 1604
   goals met: 7 of 9
19. (drive-truck truck2 s1 s2 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   changed: (fuel-used) from 1604 to 1974
   goals met: 6 of 9
20. (load-truck package4 truck2 s2)
   deleted: (at package4 s2)
   added: (in package4 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 6 of 9
21. (drive-truck truck2 s2 s1 driver2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   changed: (fuel-used) from 1974 to 2381
   goals met: 7 of 9
22. (drive-truck truck2 s1 s3 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   changed: (fuel-used) from 2381 to 2601
   goals met: 6 of 9
23. (drive-truck truck1 s4 s2 driver1)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   changed: (fuel-used) from 2601 to 3131
   goals met: 5 of 9
24. (drive-truck truck2 s3 s1 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   changed: (fuel-used) from 3131 to 3351
   goals met: 6 of 9
25. (drive-truck truck2 s1 s0 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   changed: (fuel-used) from 3351 to 3659
   goals met: 5 of 9
26. (unload-truck package4 truck2 s0)
   deleted: (in package4 truck2)
   added: (at package4 s0)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 6 of 9
27. (disembark-truck driver2 truck2 s0)
   deleted: (driving driver2 truck2)
   added: (at driver2 s0) (empty truck2)
   goals met: 6 of 9
28. (walk driver2 s0 p3-0)
   deleted: (at driver2 s0)
   added: (at driver2 p3-0)
   goals met: 6 of 9
29. (walk driver2 p3-0 s3)
   deleted: (at driver2 p3-0)
   added: (at driver2 s3)
   goals met: 7 of 9
30. (drive-truck truck1 s2 s0 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   changed: (fuel-used) from 3659 to 3709
   goals met: 7 of 9
31. (disembark-truck driver1 truck1 s0)
   deleted: (driving driver1 truck1)
   added: (at driver1 s0) (empty truck1)
   goals met: 7 of 9
32. (board-truck driver1 truck2 s0)
   deleted: (at driver1 s0) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 7 of 9
33. (walk driver2 s3 p3-0)
   deleted: (at driver2 s3)
   added: (at driver2 p3-0)
   goals met: 6 of 9
34. (drive-truck truck2 s0 s1 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (fuel-used) from 3709 to 3989
   goals met: 7 of 9
35. (walk driver2 p3-0 s0)
   deleted: (at driver2 p3-0)
   added: (at driver2 s0)
   goals met: 7 of 9
36. (board-truck driver2 truck1 s0)
   deleted: (at driver2 s0) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 7 of 9
37. (drive-truck truck1 s0 s2 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (fuel-used) from 3989 to 4039
   goals met: 7 of 9
38. (disembark-truck driver2 truck1 s2)
   deleted: (driving driver2 truck1)
   added: (at driver2 s2) (empty truck1)
   goals met: 7 of 9
39. (disembark-truck driver1 truck2 s1)
   deleted: (driving driver1 truck2)
   added: (at driver1 s1) (empty truck2)
   goals met: 7 of 9
40. (walk driver2 s2 p2-0)
   deleted: (at driver2 s2)
   added: (at driver2 p2-0)
   goals met: 7 of 9
41. (walk driver2 p2-0 s0)
   deleted: (at driver2 p2-0)
   added: (at driver2 s0)
   goals met: 7 of 9
42. (walk driver2 s0 p3-0)
   deleted: (at driver2 s0)
   added: (at driver2 p3-0)
   goals met: 7 of 9
43. (walk driver1 s1 p2-1)
   deleted: (at driver1 s1)
   added: (at driver1 p2-1)
   goals met: 7 of 9
44. (walk driver2 p3-0 s3)
   deleted: (at driver2 p3-0)
   added: (at driver2 s3)
   goals met: 8 of 9
45. (walk driver1 p2-1 s2)
   deleted: (at driver1 p2-1)
   added: (at driver1 s2)
   goals met: 8 of 9
46. (board-truck driver1 truck1 s2)
   deleted: (at driver1 s2) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 8 of 9
47. (drive-truck truck1 s2 s4 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   changed: (fuel-used) from 4039 to 4569
   goals met: 9 of 9
